testing-suite/performance/artillery-load-test.yml
# Artillery 负载测试配置
# 模拟真实电商用户行为：浏览、搜索、加购、结账

config:
  target: "{{ $processEnvironment.TEST_URL }}"
  phases:
    # Phase 1: 预热阶段
    - duration: 60
      arrivalRate: 5
      name: "Warm up - 5 users/sec"
    
    # Phase 2: 正常负载
    - duration: 180
      arrivalRate: 20
      name: "Normal load - 20 users/sec"
    
    # Phase 3: 高峰期
    - duration: 120
      arrivalRate: 50
      name: "Peak load - 50 users/sec"
    
    # Phase 4: 压力测试
    - duration: 60
      arrivalRate: 100
      name: "Stress test - 100 users/sec"
    
    # Phase 5: 降温
    - duration: 30
      arrivalRate: 10
      name: "Cool down - 10 users/sec"
  
  # 性能阈值
  ensure:
    maxErrorRate: 1  # 错误率不超过 1%
    p95: 2000        # 95% 请求在 2 秒内完成
    p99: 5000        # 99% 请求在 5 秒内完成
  
  # HTTP 配置
  http:
    timeout: 30
    pool: 50  # 连接池大小
  
  # 自定义变量
  variables:
    testEmail: "loadtest-{{ $randomString() }}@test.com"

scenarios:
  # ==========================================
  # 场景 1: 浏览型用户（60% 流量）
  # ==========================================
  - name: "Browser - 浏览不购买"
    weight: 60
    flow:
      # 访问首页
      - get:
          url: "/"
          capture:
            - json: "$.featured"
              as: "featuredProducts"
      
      # 查看产品列表
      - get:
          url: "/api/products"
          capture:
            - json: "$.products[0].id"
              as: "firstProductId"
      
      - think: 2  # 用户浏览 2 秒
      
      # 查看产品详情
      - get:
          url: "/api/products/{{ firstProductId }}"
      
      - think: 3  # 阅读商品详情 3 秒
      
      # 查看更多产品
      - get:
          url: "/api/products?page=2"
      
      - think: 2
      
      # 使用搜索
      - get:
          url: "/api/products/search?q=protein"
      
      - think: 1
      
      # 离开网站（不购买）

  # ==========================================
  # 场景 2: 购物用户（30% 流量）
  # ==========================================
  - name: "Shopper - 加购并结账"
    weight: 30
    flow:
      # 浏览产品
      - get:
          url: "/api/products"
          capture:
            - json: "$.products[0].id"
              as: "productId1"
            - json: "$.products[1].id"
              as: "productId2"
      
      - think: 2
      
      # 查看第一个产品
      - get:
          url: "/api/products/{{ productId1 }}"
          capture:
            - json: "$.product.priceCad"
              as: "price1"
      
      - think: 3
      
      # 加入购物车（通过前端状态管理，这里不测试）
      
      # 查看第二个产品
      - get:
          url: "/api/products/{{ productId2 }}"
      
      - think: 2
      
      # 模拟结账流程（创建 Stripe session）
      - post:
          url: "/api/checkout"
          json:
            email: "{{ testEmail }}"
            items:
              - productId: "{{ productId1 }}"
                quantity: 1
          capture:
            - json: "$.url"
              as: "checkoutUrl"
          expect:
            - statusCode: 200
      
      # 注意：不实际跳转到 Stripe（会产生真实费用）

  # ==========================================
  # 场景 3: 搜索用户（10% 流量）
  # ==========================================
  - name: "Searcher - 搜索并查看结果"
    weight: 10
    flow:
      # 各种搜索查询
      - get:
          url: "/api/products/search?q=protein"
      
      - think: 1
      
      - get:
          url: "/api/products/search?q=whey"
      
      - think: 1
      
      - get:
          url: "/api/products/search?q=supplement"
      
      - think: 2
      
      # 查看搜索结果中的产品
      - get:
          url: "/api/products/{{ $randomNumber(1, 20) }}"

  # ==========================================
  # 场景 4: Admin 用户（少量）
  # ==========================================
  - name: "Admin - 管理操作"
    weight: 5
    flow:
      # 注意：需要先登录获取 session
      # 这里简化处理，实际需要 cookie
      
      # 查看订单列表
      - get:
          url: "/api/admin/orders"
          expect:
            - statusCode: [200, 401, 403]  # 可能未授权
      
      - think: 2
      
      # 查看产品列表
      - get:
          url: "/api/admin/products"
          expect:
            - statusCode: [200, 401, 403]
      
      - think: 1
      
      # 查看 Dashboard
      - get:
          url: "/api/admin/dashboard"
          expect:
            - statusCode: [200, 401, 403]

  # ==========================================
  # 场景 5: 分类筛选（经常使用）
  # ==========================================
  - name: "Filter - 使用分类筛选"
    weight: 15
    flow:
      # 获取分类列表
      - get:
          url: "/api/categories"
          capture:
            - json: "$.categories[0].id"
              as: "categoryId"
      
      - think: 1
      
      # 按分类筛选
      - get:
          url: "/api/products?category={{ categoryId }}"
      
      - think: 2
      
      # 排序测试
      - get:
          url: "/api/products?category={{ categoryId }}&sort=price_asc"
      
      - think: 1
      
      - get:
          url: "/api/products?category={{ categoryId }}&sort=price_desc"
      
      - think: 2
      
      # 分页测试
      - get:
          url: "/api/products?category={{ categoryId }}&page=2"

  # ==========================================
  # 场景 6: 高频 API 调用（压力测试）
  # ==========================================
  - name: "API Stress - 快速连续调用"
    weight: 5
    flow:
      # 快速连续调用多个 API
      - get:
          url: "/api/products"
      - get:
          url: "/api/categories"
      - get:
          url: "/api/products/{{ $randomNumber(1, 20) }}"
      - get:
          url: "/api/products/{{ $randomNumber(1, 20) }}"
      - get:
          url: "/api/products/{{ $randomNumber(1, 20) }}"
      
      # 没有 think，连续请求

# ==========================================
# 自定义插件（可选）
# ==========================================
plugins:
  expect: {}  # 启用断言插件
  metrics-by-endpoint: {}  # 按端点统计指标